; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v2 ?v1)
             (pred_6 ?v3 ?v10)
             (pred_4 ?v2 ?v10)
             (pred_12 ?v13 ?v2 )
	     (pred_1 ?v2)
             (pred_10 ?v6)
             (pred_5 ?v3)
             (pred_11 ?v10)
             (pred_2 ?v2)
             (pred_3 ?v3)
             (pred_9 ?v2)
             (pred_7 ))



(:action op_4
:parameters (?v4 ?v7 ?v12 ?v11)
:precondition (and (pred_10 ?v4) (pred_10 ?v7) (pred_5 ?v12) (pred_11 ?v11)
          (pred_8 ?v4 ?v7) (pred_6 ?v12 ?v11)
                   (pred_4 ?v7 ?v11) (pred_1 ?v4) 
                   (pred_2 ?v7) (pred_3 ?v12))
:effect (and  (pred_9 ?v7) (not (pred_2 ?v7))))


(:action op_5
:parameters (?v4 ?v5)
:precondition (and (pred_10 ?v4) (pred_10 ?v5)
               (pred_1 ?v4) (pred_8 ?v4 ?v5) (pred_9 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v4))))

(:action op_1
:parameters (?v4 ?v12)
:precondition (and (pred_10 ?v4) (pred_5 ?v12) 
                  (pred_1 ?v4) (pred_12 ?v12 ?v4) (pred_7 ))
:effect (and (pred_3 ?v12)
   (not (pred_12 ?v12 ?v4)) (not (pred_7 ))))


(:action op_3
:parameters (?v4 ?v9 ?v8)
:precondition (and (pred_10 ?v4) (pred_5 ?v9) (pred_5 ?v8)
                  (pred_1 ?v4) (pred_3 ?v8) (pred_12 ?v9 ?v4))
:effect (and (pred_3 ?v9) (pred_12 ?v8 ?v4)
        (not (pred_3 ?v8)) (not (pred_12 ?v9 ?v4))))

(:action op_2
:parameters (?v4 ?v12)
:precondition (and (pred_10 ?v4) (pred_5 ?v12) 
                  (pred_1 ?v4) (pred_3 ?v12))
:effect (and (pred_7 ) (pred_12 ?v12 ?v4) (not (pred_3 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_12 obj_08 obj_05 obj_03 obj_09 obj_10 obj_07 obj_04
    obj_02 obj_01
    obj_06 obj_11
    )

    (:init
       (pred_7)

       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_11 obj_02)
       (pred_11 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_11)

       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_03 obj_07)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_12)
       (pred_4  obj_09 obj_02)
       (pred_4  obj_12 obj_01)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_03)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_04)

       (pred_6  obj_06 obj_02)
       (pred_6  obj_11 obj_01)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_11 obj_05)
       (pred_1 obj_04)
    )

    (:goal (and
       (pred_12 obj_11 obj_13)
    ))
(:constraints
  (always (not (pred_1 obj_03)))
)
)

; plan
1. (op_5 obj_04 obj_07)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_07)
   goals met: 0 of 1
2. (op_5 obj_07 obj_10)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_05)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_11)
   deleted: (pred_12 obj_11 obj_05) (pred_7)
   added: (pred_3 obj_11)
   goals met: 0 of 1
5. (op_5 obj_05 obj_13)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_7) (pred_12 obj_11 obj_13)
   goals met: 1 of 1
